Ran Plan for 2 projects:

1. dir: `terraform/harbor/01-projects` workspace: `default`
1. dir: `terraform/harbor/robot_account` workspace: `default`
---

### 1. dir: `terraform/harbor/01-projects` workspace: `default`
```diff
harbor_project.my_project: Refreshing state... [id=/projects/3]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/harbor/01-projects
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.nishiokatest.xyz/lock?id=nishioka-shinji%252Fmy_infra%252Fterraform%252Fharbor%252F01-projects%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/harbor/01-projects
  ```

---
### 2. dir: `terraform/harbor/robot_account` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.my_project: Reading...
data.terraform_remote_state.my_project: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # harbor_robot_account.github-actions-pusher will be created
+ resource "harbor_robot_account" "github-actions-pusher" {
      + disable   = false
      + duration  = -1
      + full_name = (known after apply)
      + id        = (known after apply)
      + level     = "system"
      + name      = "github-actions-pusher"
      + robot_id  = (known after apply)
      + secret    = (sensitive value)

      + permissions {
          + kind      = "project"
          + namespace = "my_project"

          + access {
              + action   = "pull"
              + resource = "repository"
                # (1 unchanged attribute hidden)
            }
          + access {
              + action   = "push"
              + resource = "repository"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/harbor/robot_account
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.nishiokatest.xyz/lock?id=nishioka-shinji%252Fmy_infra%252Fterraform%252Fharbor%252Frobot_account%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/harbor/robot_account
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```